x = "-1"
while not x.isdigit() or int(x) > 999 or int(x) < 0:
    x = input("Enter any natural number from 0 to 999")
n = int(x)
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
ones = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
print(hundreds[n // 100], tens[(n // 10) % 10], ones[n % 10])
