from unittest import case

x = "-1"
while not x.isdigit() or int(x) > 999 or int(x) < 0:
    x = input("Enter any natural number from 0 to 999")
n = int(x)
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
ones = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]

if 10 < n < 20:
    if n == 11:
        print ("одиннадцать")
    if n == 12:
        print("двенадцать")
    if n == 13:
        print("тринадцать")
    if n == 14:
        print("четырнадцать")
    if n == 15:
        print("пятнадцать")
    if n == 16:
        print("шестнадцать")
    if n == 17:
        print("семнадцать")
    if n == 18:
        print("восемнадцать")
    if n == 19:
        print("девятнадцать")
else:
    print(hundreds[n // 100], tens[(n // 10) % 10], ones[n % 10])
